cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3C1x4_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>CAPSENSE_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>CAPSENSE_0</groupName>
			<baseAddress>0x40023000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CAPSENSE0_IRQn</name>
				<value>39</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000040</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BUSYF</name>
							<description>Start and Busy Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>IDLE</name>
									<description>Read: A capacitive sensing conversion is complete or a conversion is not currently in progress. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BUSY</name>
									<description>Read: A capacitive sensing conversion is in progress. Write: Initiate a capacitive sensing conversion if BUSYF is selected as the start of conversion source.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSEN</name>
							<description>Module Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the capacitive sensing module.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the capacitive sensing module.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BIASEN</name>
							<description>Bias Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the bias.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the bias.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPPOL</name>
							<description>Digital Comparator Polarity Select. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GT</name>
									<description>The digital comparator generates an interrupt if the conversion is greater than the CSTH threshold.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LTE</name>
									<description>The digital comparator generates an interrupt if the conversion is less than or equal to the CSTH threshold.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMD</name>
							<description>Conversion Mode Select. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SINGLE</name>
									<description>Single Conversion Mode: One conversion occurs on a single channel.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCAN</name>
									<description>Single Scan Mode: One conversion on each channel selected by SCANEN occurs. An end-of-scan interrupt indicates all channels have been measured.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONT_SINGLE</name>
									<description>Continuous Single Conversion Mode: Continuously converts on a single channel. This operation ends only if the module is disabled (CSEN = 0) or if a compare threshold event occurs (CMPI = 1).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONT_SCAN</name>
									<description>Continuous Scan Mode: Continuously loops through and converts on all the channels selected by SCANEN. This operation ends only if the module is disabled (CSEN = 0) or if a compare threshold event occurs (CMPI = 1).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNVR</name>
							<description>Conversion Rate. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>12BIT</name>
									<description>Conversions last 12 internal CAPSENSE clocks and results are 12 bits in length.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>13BIT</name>
									<description>Conversions last 13 internal CAPSENSE clocks and results are 13 bits in length.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>14BIT</name>
									<description>Conversions last 14 internal CAPSENSE clocks and results are 14 bits in length.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16BIT</name>
									<description>Conversions last 16 internal CAPSENSE clocks and results are 16 bits in length.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACCMD</name>
							<description>Accumulator Mode Select. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ACC_1</name>
									<description>Accumulate 1 sample.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC_4</name>
									<description>Accumulate 4 samples.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC_8</name>
									<description>Accumulate 8 samples.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC_16</name>
									<description>Accumulate 16 samples.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC_32</name>
									<description>Accumulate 32 samples.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC_64</name>
									<description>Accumulate 64 samples.</description>
									<value>5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCEN</name>
							<description>Multiple Channel Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the multiple channel measurement feature.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the multiple channel measurement feature.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSCM</name>
							<description>Start of Conversion Mode Select. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CSNT0</name>
									<description>The CSnT0 (&quot;On Demand&quot; by writing 1 to CSBUSY) trigger source starts conversions.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT1</name>
									<description>The CSnT1 (Timer 0 Low Overflow) trigger source starts conversions.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT2</name>
									<description>The CSnT2 (Timer 0 High Overflow) trigger source starts conversions.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT3</name>
									<description>The CSnT3 (Timer 1 Low Overflow) trigger source starts conversions.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT4</name>
									<description>The CSnT4 (Timer 1 High Overflow) trigger source starts conversions.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT5</name>
									<description>The CSnT5 (I2C0 Timer Byte 1 Overflow) trigger source starts conversions.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT6</name>
									<description>The CSnT6 (I2C0 Timer Byte 3 Overflow) trigger source starts conversions.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT7</name>
									<description>The CSnT7 (I2C1 Timer Byte 1 Overflow) trigger source starts conversions.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT8</name>
									<description>The CSnT8 (I2C1 Timer Byte 3 Overflow) trigger source starts conversions.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT9</name>
									<description>The CSnT9 (RESERVED) trigger source starts conversions.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT10</name>
									<description>The CSnT10 (RESERVED) trigger source starts conversions.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT11</name>
									<description>The CSnT11 (RESERVED) trigger source starts conversions.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT12</name>
									<description>The CSnT12 (RESERVED) trigger source starts conversions.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT13</name>
									<description>The CSnT13 (RESERVED) trigger source starts conversions.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT14</name>
									<description>The CSnT14 (RESERVED) trigger source starts conversions.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSNT15</name>
									<description>The CSnT15 (RESERVED) trigger source starts conversions.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMMD</name>
							<description>Pin Monitor Mode. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ALWAYS_RETRY</name>
									<description>Always retry on a pin state change.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RETRY_TWICE</name>
									<description>Retry up to twice on consecutive bit cycles.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RETRY_FOUR_TIMES</name>
									<description>Retry up to four times on consecutive bit cycles.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DO_NOT_RETRY</name>
									<description>Ignore monitored signal state change.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMEF</name>
							<description>Pin Monitor Event Flag. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A retry did not occur due to a pin monitor event during the last conversion.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A retry occurred due to a pin monitor event during the last conversion.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPEN</name>
							<description>Threshold Comparator Enable. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the threshold comparator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the threshold comparator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDIEN</name>
							<description>Conversion Done Interrupt Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the single conversion done interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the single conversion done interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOSIEN</name>
							<description>End-of-Scan Interrupt Enable. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the single scan end-of-scan interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the single scan end-of-scan interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPI</name>
							<description>Threshold Comparator Interrupt Flag. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The capacitive sensing result did not cause a compare threshold interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The capacitive sensing result caused a compare threshold interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDI</name>
							<description>Conversion Done Interrupt Flag. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: The CAPSENSEn module has not completed a data conversion since the last time CDI was cleared. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: The CAPSENSEn module completed a data conversion. Write: Force a conversion complete interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOSI</name>
							<description>End-of-Scan Interrupt Flag. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The CAPSENSEn module has not completed a scan since the last time EOSI was cleared.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The CAPSENSEn module completed a scan.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODE</name>
					<description>Measurement Mode</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000007</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CGSEL</name>
							<description>Capacitance Gain Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>DRSEL</name>
							<description>Double Reset Select. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>RAMPSEL</name>
							<description>Ramp Selection. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>IASEL</name>
							<description>Output Current Select. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>DTSEL</name>
							<description>Discharge Time Select. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>LPFSEL</name>
							<description>Low Pass Filter Select. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>Measurement Data</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Capacitive Sensing Data. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SCAN</name>
					<description>Channel Scan Enable</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SCANEN</name>
							<description>Channel Scan Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CSTH</name>
					<description>Compare Threshold</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CSTH</name>
							<description>Compare Threshold. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MUX</name>
					<description>Mux Channel Select</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x00000080</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CSMX</name>
							<description>Mux Channel Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CSN0</name>
									<description>Select CSn.0 (PB0.2).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN1</name>
									<description>Select CSn.1 (PB0.3).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN2</name>
									<description>Select CSn.2 (PB0.4).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN3</name>
									<description>Select CSn.3 (PB0.6).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN4</name>
									<description>Select CSn.4 (PB0.7).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN5</name>
									<description>Select CSn.5 (RESERVED).</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN6</name>
									<description>Select CSn.6 (RESERVED).</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN7</name>
									<description>Select CSn.7 (PB0.0).</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN8</name>
									<description>Select CSn.8 (RESERVED).</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN9</name>
									<description>Select CSn.9 (RESERVED).</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN10</name>
									<description>Select CSn.10 (PB0.12).</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN11</name>
									<description>Select CSn.11 (PB0.13).</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN12</name>
									<description>Select CSn.12 (PB0.14).</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN13</name>
									<description>Select CSn.13 (PB0.15).</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN14</name>
									<description>Select CSn.14 (PB1.0).</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CSN15</name>
									<description>Select CSn.15 (PB1.1).</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSDISC</name>
							<description>Channel Disconnect. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CONNECT</name>
									<description>Connect the capacitive sensing circuit to the selected channel.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISCONNECT</name>
									<description>Disconnect the capacitive sensing input channel.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
