cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3C1x4_SVD.xml
				<register>
					<name>STATUS</name>
					<description>Module Status</description>
					<addressOffset>0x1a0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>C0CCI</name>
							<description>Channel 0 Capture/Compare Interrupt Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A Channel 0 match or capture event did not occur.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A Channel 0 match or capture event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C1CCI</name>
							<description>Channel 1 Capture/Compare Interrupt Flag. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A Channel 1 match or capture event did not occur.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A Channel 1 match or capture event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C2CCI</name>
							<description>Channel 2 Capture/Compare Interrupt Flag. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A Channel 2 match or capture event did not occur.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A Channel 2 match or capture event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C3CCI</name>
							<description>Channel 3 Capture/Compare Interrupt Flag. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A Channel 3 match or capture event did not occur.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A Channel 3 match or capture event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C4CCI</name>
							<description>Channel 4 Capture/Compare Interrupt Flag. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A Channel 4 match or capture event did not occur.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A Channel 4 match or capture event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C5CCI</name>
							<description>Channel 5 Capture/Compare Interrupt Flag. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A Channel 5 match or capture event did not occur.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A Channel 5 match or capture event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RUN</name>
							<description>Counter/Timer Run. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop the EPCA Counter/Timer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start the EPCA Counter/Timer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVFI</name>
							<description>Counter/Timer Overflow/Limit Interrupt Flag. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>An EPCA Counter/Timer overflow/limit event did not occur.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>An EPCA Counter/Timer overflow/limit event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPDCF</name>
							<description>Register Update Complete Flag. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>An EPCA register update completed or is not pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>An EPCA register update has not completed and is still pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HALTI</name>
							<description>Halt Input Interrupt Flag. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The Halt input (PB_HDKill) was not asserted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The Halt input (PB_HDKill) was asserted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C0IOVFI</name>
							<description>Channel 0 Intermediate Overflow Interrupt Flag. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Channel 0 did not count past the channel n-bit mode limit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Channel 0 counted past the channel n-bit mode limit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C1IOVFI</name>
							<description>Channel 1 Intermediate Overflow Interrupt Flag. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Channel 1 did not count past the channel n-bit mode limit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Channel 1 counted past the channel n-bit mode limit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C2IOVFI</name>
							<description>Channel 2 Intermediate Overflow Interrupt Flag. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Channel 2 did not count past the channel n-bit mode limit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Channel 2 counted past the channel n-bit mode limit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C3IOVFI</name>
							<description>Channel 3 Intermediate Overflow Interrupt Flag. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Channel 3 did not count past the channel n-bit mode limit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Channel 3 counted past the channel n-bit mode limit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C4IOVFI</name>
							<description>Channel 4 Intermediate Overflow Interrupt Flag. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Channel 4 did not count past the channel n-bit mode limit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Channel 4 counted past the channel n-bit mode limit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C5IOVFI</name>
							<description>Channel 5 Intermediate Overflow Interrupt Flag. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Channel 5 did not count past the channel n-bit mode limit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Channel 5 counted past the channel n-bit mode limit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>COUNTER</name>
					<description>Module Counter/Timer</description>
					<addressOffset>0x1b0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COUNTER</name>
							<description>Counter/Timer. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>LIMIT</name>
					<description>Module Upper Limit</description>
					<addressOffset>0x1c0</addressOffset>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LIMIT</name>
							<description>Upper Limit. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>LIMITUPD</name>
					<description>Module Upper Limit Update Value</description>
					<addressOffset>0x1d0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LIMITUPD</name>
							<description>Module Upper Limit Update Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DTIME</name>
					<description>Phase Delay Time</description>
					<addressOffset>0x1e0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DTIMEX</name>
							<description>X Phase Delay Time. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>DTIMEY</name>
							<description>Y Phase Delay Time. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DTARGET</name>
					<description>DMA Transfer Target</description>
					<addressOffset>0x200</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DTARGET</name>
							<description>DMA Transfer Target. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<!--BASEPOINTER_START_2-->
				<register>
					<name>MODE_0</name>
					<description>Channel Capture/Compare Mode</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COSEL</name>
							<description>Channel Output Function Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT</name>
									<description>Toggle the channel output at the next capture/compare, overflow, or intermediate event.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT</name>
									<description>Set the channel output at the next capture/compare, overflow, or intermediate event.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT</name>
									<description>Clear the output at the next capture/compare, overflow, or intermediate event.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_CHANGE</name>
									<description>Capture/Compare, overflow, or intermediate events do not control the output state.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMD</name>
							<description>PWM N-Bit Mode. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DIFGEN</name>
							<description>Differential Signal Generator Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the differential signal generator. The channel will output a single non-differential output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the differential signal generator. The channel will output two differential outputs: X Phase (XPH) and Y Phase (YPH).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMD</name>
							<description>Channel Operating Mode. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>EDGE_PWM</name>
									<description>Configure the channel for edge-aligned PWM mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CENTER_ALIGNED_PWM</name>
									<description>Configure the channel for center-aligned PWM mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HF_SQUARE_WAVE</name>
									<description>Configure the channel for high-frequency/square-wave mode.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER_CAPTURE</name>
									<description>Configure the channel for timer/capture mode.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>N_BIT_PWM</name>
									<description>Configure the channel for n-bit edge-aligned PWM mode.</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
