cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3C1x4_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>TIMER_1</name>
			<version>A</version>
			<description>None</description>
			<groupName>Timer</groupName>
			<baseAddress>0x40015000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIMER1L_IRQn</name>
				<value>22</value>
			</interrupt>
			<interrupt>
				<name>TIMER1H_IRQn</name>
				<value>23</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONFIG</name>
					<description>High and Low Timer Configuration</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LCLK</name>
							<description>Low Clock Source. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>APB</name>
									<description>Select the APB clock as the timer source.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTOSCN</name>
									<description>Select the external oscillator clock as the timer source. The external oscillator must run slower than one-half the APB clock.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER_CLKDIV</name>
									<description>Select the dedicated 8-bit prescaler as the timer source.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CT_FALLING_EDGE</name>
									<description>Select falling edges of the CT signal as the timer clock source.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LMSTREN</name>
							<description>Low Run Master Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>MSTRUN does not need to be set for the low timer to run.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>MSTRUN must be set for the low timer to run.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPLITEN</name>
							<description>Split Mode Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The timer operates as a single 32-bit timer controlled by the high timer fields.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The timer operates as two independent 16-bit timers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LEXIEN</name>
							<description>Low Timer Extra Interrupt Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The state of the LEXI flag does not affect the low timer interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>A low timer interrupt request is generated if LEXI is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOVFIEN</name>
							<description>Low Timer Overflow Interrupt Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The state of LOVFI does not affect the low timer interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>A low timer interrupt request is generated if LOVFI = 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LMD</name>
							<description>Low Timer Mode. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>AUTO_RELOAD</name>
									<description>The low timer is in Auto-Reload Mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UP_DOWN</name>
									<description>The low timer is in Up/Down Count Mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL_CAPTURE</name>
									<description>The low timer is in Falling Edge Capture Mode.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISE_CAPTURE</name>
									<description>The low timer is in Rising Edge Capture Mode.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_CAPTURE</name>
									<description>The low timer is in Low Time Capture Mode.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_CAPTURE</name>
									<description>The low timer is in High Time Capture Mode.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DC_CAPTURE</name>
									<description>The low timer is in Duty Cycle Capture Mode.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONESHOT</name>
									<description>The low timer is in Oneshot Mode.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LSTATE</name>
							<description>Low Multi Purpose State Indicator. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LRUN</name>
							<description>Run Control Low. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop the low timer if split mode is enabled (SPLITEN = 1).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>The low timer runs if split mode is enabled (SPLITEN = 1) and (LMSTREN = 0 or MSTRUN = 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LEXI</name>
							<description>Low Timer Extra Interrupt Flag. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A low timer extra interrupt is not pending. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Indicates the low 16-bit timer has been captured, reloaded with all 1's when counting down, or the timer matched the capture register in PWM mode. This interrupt flag can be set by hardware in all modes except Auto-Reload and Toggle. This flag is not set by hardware when split mode is disabled (SPLITEN = 0). Write: Force a low timer extra interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOVFI</name>
							<description>Low Timer Overflow Interrupt. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A low timer overflow interrupt is not pending. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: The low 16-bit timer has wrapped or reloaded after reaching all 1's. This bit is set by the module regardless of the state of SPLITEN and can be set in all modes. Write: Force a low timer overflow interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HCLK</name>
							<description>High Clock Source. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>APB</name>
									<description>Select the APB clock as the timer source.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTOSCN</name>
									<description>Select the external oscillator clock as the timer source. The external oscillator must run slower than one-half the APB clock.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER_CLKDIV</name>
									<description>Select the dedicated 8-bit prescaler as the timer source.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CT_FALLING_EDGE</name>
									<description>Select falling edges of the CT signal as the timer clock source.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTRUN</name>
							<description>Master Run Control. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Disable the master run control for all timers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Enable the master run control for all timers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HMSTREN</name>
							<description>High Master Enable. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>MSTRUN does not need to be set for the high timer to run.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>MSTRUN must be set for the high timer to run.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBGMD</name>
							<description>Timer Debug Mode. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RUN</name>
									<description>The Timer will continue to operate while the core is halted in debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will cause the Timer to halt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HEXIEN</name>
							<description>High Timer Extra Interrupt Enable. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The state of the HEXI flag does not affect the high timer interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>A high timer interrupt request is generated if HEXI is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HOVFIEN</name>
							<description>High Timer Overflow Interrupt Enable. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The state of HOVFI does not affect the high timer interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>A high timer interrupt request is generated if HOVFI is set to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HMD</name>
							<description>High Timer Mode. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>AUTO_RELOAD</name>
									<description>The high 16-bit timer or entire 32-bit timer is in Auto-Reload Mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UP_DOWN</name>
									<description>The high 16-bit timer or entire 32-bit timer is in Up/Down Count Mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALL_CAPTURE</name>
									<description>The high 16-bit timer or entire 32-bit timer is in Falling Edge Capture Mode.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISE_CAPTURE</name>
									<description>The high 16-bit timer or entire 32-bit timer is in Rising Edge Capture Mode.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_CAPTURE</name>
									<description>The high 16-bit timer or entire 32-bit timer is in Low Time Capture Mode.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_CAPTURE</name>
									<description>The high 16-bit timer or entire 32-bit timer is in High Time Capture Mode.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DC_CAPTURE</name>
									<description>The high 16-bit timer or entire 32-bit timer is in Duty Cycle Capture Mode.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONESHOT</name>
									<description>The high 16-bit timer or entire 32-bit timer is in Oneshot Mode.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>The high 16-bit timer or entire 32-bit timer is in Toggle Output Mode.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM</name>
									<description>The high 16-bit timer or entire 32-bit timer is in PWM Mode.</description>
									<value>9</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HSTATE</name>
							<description>High Multi Purpose State Indicator. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HRUN</name>
							<description>High Run Control. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop the high timer or entire 32-bit timer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>The high timer runs if HMSTREN = 0 or MSTRUN = 1. The full 32-bit timer runs if split mode is disabled and (HMSTREN = 0 or MSTRUN = 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HEXI</name>
							<description>High Timer Extra Interrupt Flag. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A high timer extra interrupt is not pending. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Indicates the high 16-bit timer (or 32-bit timer if SPLITEN = 0) has been captured, reloaded with all 1's when counting down, or the timer matched the capture register in PWM mode. This interrupt flag can be set by the timer module in all modes except Auto-Reload and Toggle. Write: Force a high timer extra interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HOVFI</name>
							<description>High Timer Overflow Interrupt Flag. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A high timer overflow interrupt is not pending. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: If split mode is enabled (SPLITEN = 1), this value indicates the high 16-bit timer has wrapped or reloaded after reaching all 1's. If split mode is disabled (SPLITEN = 0), this value indicates the 32-bit timer has wrapped or reloaded after reaching all 1's. The timer module can set this bit in all modes. Write: Force a high timer overflow interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKDIV</name>
					<description>Module Clock Divider Control</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKDIVRL</name>
							<description>Clock Divider Reload Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CLKDIVCT</name>
							<description>Clock Divider Counter. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COUNT</name>
					<description>Timer Value</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LCOUNT</name>
							<description>Low Timer Count. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>HCOUNT</name>
							<description>High Timer Count. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CAPTURE</name>
					<description>Timer Capture/Reload Value</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LCCR</name>
							<description>Low Timer Capture/Reload. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>HCCR</name>
							<description>High Timer Capture/Reload. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
