cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3C1x4_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>EXTVREG_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>Voltage_Regulators</groupName>
			<baseAddress>0x40042000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SAEN</name>
							<description>Stand-Alone Mode Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Use the external regulator in normal mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Use the external regulator in stand-alone mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WPULLEN</name>
							<description>Weak Pull Up/Down Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the external regulator weak pull-up/down resistor on the EXREGBD pin and weak pull-down resistor on the EXREGOUT pin.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the external regulator weak pull-up/down resistor on the EXREGBD pin and weak pull-down resistor on the EXREGOUT pin.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FBLEN</name>
							<description>Foldback Limiting Enable. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable foldback limiting.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable foldback limiting.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PNSEL</name>
							<description>NPN/PNP Type Select. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NPN</name>
									<description>Select NPN Mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PNP</name>
									<description>Select PNP Mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FBPINSEL</name>
							<description>Foldback Sensing Pin Select. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>EXREGSN</name>
									<description>Use the input to the EXREGSN pin for foldback limiting.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREGIN</name>
									<description>Use the input to the VREGIN pin for foldback limiting.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EVREGEN</name>
							<description>External Regulator Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the external regulator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the external regulator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CONFIG</name>
					<description>Module Configuration</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IMINFINE</name>
							<description>Minimum Current Fine Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>0_UA</name>
									<description>Minimum current limit is IMIN current + 0 uA. </description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0P25_UA</name>
									<description>Minimum current limit is IMIN current + 0.25 uA.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0P5_UA</name>
									<description>Minimum current limit is IMIN current + 0.50 uA.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0P75_UA</name>
									<description>Minimum current limit is IMIN current + 0.75 uA.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IMIN</name>
							<description>Minimum Current Select. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>1_UA</name>
									<description>Minimum current limit is 1 uA + IMINFINE current.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_UA</name>
									<description>Minimum current limit is 2 uA + IMINFINE current.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_UA</name>
									<description>Minimum current limit is 3 uA + IMINFINE current.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_UA</name>
									<description>Minimum current limit is 4 uA + IMINFINE current.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_UA</name>
									<description>Minimum current limit is 5 uA + IMINFINE current.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_UA</name>
									<description>Minimum current limit is 6 uA + IMINFINE current.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_UA</name>
									<description>Minimum current limit is 7 uA + IMINFINE current.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_UA</name>
									<description>Minimum current limit is 8 uA + IMINFINE current.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FBVOSEL</name>
							<description>Foldback Voltage Offset Select. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>0_V</name>
									<description>Foldback voltage offset is 0 V.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0P5_V</name>
									<description>Foldback voltage offset is 0.5 V.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_V</name>
									<description>Foldback voltage offset is 1 V.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1P5_V</name>
									<description>Foldback voltage offset is 1.5 V.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_V</name>
									<description>Foldback voltage offset is 2 V.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2P5_V</name>
									<description>Foldback voltage offset is 2.5 V.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_V</name>
									<description>Foldback voltage offset is 3 V.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3P5_V</name>
									<description>Foldback voltage offset is 3.5 V.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FBRATE</name>
							<description>Voltage Sense Gain Multiplier. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>4_UA_PER_V</name>
									<description>Set the foldback rate to 4 uA/V.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_UA_PER_V</name>
									<description>Set the foldback rate to 2 uA/V.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_UA_PER_V</name>
									<description>Set the foldback rate to 1 uA/V.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0P5_UA_PER_V</name>
									<description>Set the foldback rate to 0.5 uA/V.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_UA_PER_V</name>
									<description>Set the foldback rate to 8 uA/V.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_UA_PER_V</name>
									<description>Set the foldback rate to 16 uA/V.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_UA_PER_V</name>
									<description>Set the foldback rate to 32 uA/V.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IMAX</name>
							<description>Maximum Current Select. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>2_UA</name>
									<description>Maximum current limit is 2 uA.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_UA</name>
									<description>Maximum current limit is 3 uA.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_UA</name>
									<description>Maximum current limit is 4 uA.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_UA</name>
									<description>Maximum current limit is 5 uA.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_UA</name>
									<description>Maximum current limit is 6 uA.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_UA</name>
									<description>Maximum current limit is 7 uA.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_UA</name>
									<description>Maximum current limit is 8 uA.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_UA</name>
									<description>Maximum current limit is 9 uA.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VOUTSEL</name>
							<description>Regulator Output Voltage Select. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Module Status</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FBMAXF</name>
							<description>Maximum Foldback Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Maximum foldback has not been reached.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Maximum foldback has been reached.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CSCONTROL</name>
					<description>Current Sense Control</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ISNSEN</name>
							<description>External Regulator Current Sense Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable external regulator current sensing.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable external regulator current sensing.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCISNSEN</name>
							<description>ADC Current Sense Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable ADC current sensing.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable ADC current sensing.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CSCONFIG</name>
					<description>Current Sense Configuration</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ISADCGAIN</name>
							<description>ADC Current Sense Gain. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>16X</name>
									<description>ADC current sensing input gain is 16.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8X</name>
									<description>ADC current sensing input gain is 8.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4X</name>
									<description>ADC current sensing input gain is 4.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2X</name>
									<description>ADC current sensing input gain is 2.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1X</name>
									<description>ADC current sensing input gain is 1.</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISOGAIN</name>
							<description>External Regulator Current Sense Gain. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>16X</name>
									<description>External regulator current sensing gain is 16.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8X</name>
									<description>External regulator current sensing gain is 8.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4X</name>
									<description>External regulator current sensing gain is 4.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2X</name>
									<description>External regulator current sensing gain is 2.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1X</name>
									<description>External regulator current sensing gain is 1.</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISINSEL</name>
							<description>External Regulator Current Sense Input Select. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MODE0</name>
									<description>Select external regulator current sensing mode 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE1</name>
									<description>Select external regulator current sensing mode 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE2</name>
									<description>Select external regulator current sensing mode 2.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
